DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-COUNTER PIC 9(2) VALUE 0.
01 WS-TOTAL PIC 9(3) VALUE 0.  
PROCEDURE DIVISION.
PERFORM VARYING WS-COUNTER FROM 1 BY 1 UNTIL WS-COUNTER > 10
  ADD 1 TO WS-TOTAL
END-PERFORM. 

DISPLAY "Total: " WS-TOTAL.
STOP RUN.